<template>
  <div class="privacy-policy">
    <h1 class="policy-title">Политика обработки персональных данных</h1>
    <div class="policy-content">
      <p class="policy-text">
        Настоящая политика обработки персональных данных составлена в
        соответствии с требованиями законодательства Российской Федерации в
        области защиты персональных данных (в том числе Федерального закона от
        27.07.2006 №152-ФЗ «О персональных данных») и определяет порядок
        обработки персональных данных, а также меры по обеспечению безопасности
        персональных данных.
      </p>
      <p class="policy-text">
        Персональные данные пользователей собираются, хранятся и обрабатываются
        исключительно в целях реализации задач проекта «РЕТТкие Жизни», включая
        регистрацию пользователей, создание реестра пациентов и обратную связь.
      </p>
      <p class="policy-text">
        Обработка персональных данных осуществляется с согласия пользователя,
        выраженного в электронной форме при регистрации или подаче данных через
        Личный кабинет.
      </p>
      <p class="policy-text">
        Пользователь вправе отозвать согласие на обработку персональных данных,
        направив соответствующее уведомление через форму обратной связи.
      </p>
      <p class="policy-text">
        Проект принимает необходимые правовые, организационные и технические
        меры для защиты персональных данных от неправомерного или случайного
        доступа, уничтожения, изменения, блокирования, копирования и
        распространения, а также от иных неправомерных действий третьих лиц.
      </p>
      <p class="policy-text">
        Использование сайта означает согласие пользователя с настоящей
        политикой. При несогласии с условиями политики пользователь обязан
        воздержаться от использования сайта.
      </p>
    </div>
  </div>
</template>

<script setup></script>

<style scoped>
.privacy-policy {
  max-width: 1050px;
  margin: 0 auto;
  padding: 32px 16px;
}

.policy-title {
  font-size: 28px;
  margin-bottom: 24px;
  text-align: center;
}

.policy-content {
  display: flex;
  flex-direction: column;
  width: 100%;
  max-width: 920px;
  text-align: justify;
  border-radius: 8px;
  box-shadow: 0px 3px 8px rgba(0, 0, 0, 0.3);
  padding: 20px 35px 30px;
}

.policy-text {
  margin: 10px 0 0;
}
</style>
